{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_2"}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "filters": 24, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_1"}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1"}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_2"}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2"}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_3"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": -1, "name": "concatenate_2", "trainable": true}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3"}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_4"}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": -1, "name": "concatenate_3", "trainable": true}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4"}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "filters": 60, "kernel_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_5"}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "average_pooling2d_1"}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5"}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_6"}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_4", "config": {"axis": -1, "name": "concatenate_4", "trainable": true}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6"}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_7"}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}], ["conv2d_7", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_5", "config": {"axis": -1, "name": "concatenate_5", "trainable": true}}, {"inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7"}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_8"}}, {"inbound_nodes": [[["concatenate_5", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_6", "config": {"axis": -1, "name": "concatenate_6", "trainable": true}}, {"inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8"}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "filters": 96, "kernel_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_9"}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_2", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "average_pooling2d_2"}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9"}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_10"}}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_7", "config": {"axis": -1, "name": "concatenate_7", "trainable": true}}, {"inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10"}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_11"}}, {"inbound_nodes": [[["concatenate_7", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_8", "config": {"axis": -1, "name": "concatenate_8", "trainable": true}}, {"inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11"}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}}, "activation": "linear", "trainable": true, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "kernel_regularizer": null, "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "name": "conv2d_12"}}, {"inbound_nodes": [[["concatenate_8", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_9", "config": {"axis": -1, "name": "concatenate_9", "trainable": true}}, {"inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"center": true, "momentum": 0.99, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 1.1e-05, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12"}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}}], "output_layers": [["global_average_pooling2d_1", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "densenet"}, "class_name": "Model", "name": "densenet", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "dense_1"}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["densenet", 1, 0, {}]]]}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "feat_a"}, "class_name": "Dense", "name": "feat_a", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "name": "pred_a"}, "class_name": "Dense", "name": "pred_a", "inbound_nodes": [[["feat_a", 0, 0, {}]]]}], "output_layers": [["pred_a", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}