{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "mobilenet_0.25_64", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 64, 3], "name": "input_2", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv1", "kernel_regularizer": null, "filters": 8, "dilation_rate": [1, 1], "use_bias": false, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"axis": -1, "name": "conv1_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_1", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_1_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_1", "kernel_regularizer": null, "filters": 16, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_1_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_2", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_2_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_2", "kernel_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_2_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_3", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_3_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_3", "kernel_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_3_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_4", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_4_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_4", "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_4_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_5", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_5_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_5", "kernel_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_5_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_6", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_6_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_6", "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_6_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_7", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_7_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_7", "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_7_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_8", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_8_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_8", "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_8_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_9", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_9_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_9", "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_9_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_10", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_10_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_10", "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_10_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_11", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_11_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_11", "kernel_regularizer": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_11_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_12", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [2, 2], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_12_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_12", "kernel_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_12_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "DepthwiseConv2D", "name": "conv_dw_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "name": "conv_dw_13", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "depthwise_constraint": null, "use_bias": false, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "depthwise_regularizer": null, "depth_multiplier": 1}}, {"class_name": "BatchNormalization", "name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_dw_13_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"name": "conv_dw_13_relu", "trainable": true, "activation": "relu6"}}, {"class_name": "Conv2D", "name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "conv_pw_13", "kernel_regularizer": null, "filters": 256, "dilation_rate": [1, 1], "use_bias": false, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"axis": -1, "name": "conv_pw_13_bn", "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true}}, {"class_name": "Activation", "name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"name": "conv_pw_13_relu", "trainable": true, "activation": "relu6"}}], "output_layers": [["conv_pw_13_relu", 0, 0]], "name": "mobilenet_0.25_64", "input_layers": [["input_2", 0, 0]]}}, {"inbound_nodes": [[["mobilenet_0.25_64", 1, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "filters": 20, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "padding": "valid", "activation": "relu"}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "feat_a", "class_name": "Dense", "config": {"kernel_constraint": null, "name": "feat_a", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 32, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "relu"}}, {"inbound_nodes": [[["feat_a", 0, 0, {}]]], "name": "pred_a", "class_name": "Dense", "config": {"kernel_constraint": null, "name": "pred_a", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 1, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "linear"}}], "output_layers": [["pred_a", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}