{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.6", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "densenet", "config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["global_average_pooling2d_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 64, 64, 3]}, "name": "input_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 24, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "conv2d_1"}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_1"}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_2"}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_2"}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_3"}, "name": "conv2d_3"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "name": "concatenate_2"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_3"}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_4"}, "name": "conv2d_4"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "name": "concatenate_3"}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_4"}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_5"}, "name": "conv2d_5"}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_4"}, "name": "concatenate_4"}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_5"}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_6"}, "name": "conv2d_6"}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_5"}, "name": "concatenate_5"}, {"inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_6"}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 84, "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "conv2d_7"}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "average_pooling2d_1"}, "name": "average_pooling2d_1"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_7"}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_8"}, "name": "conv2d_8"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_6"}, "name": "concatenate_6"}, {"inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_8"}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_9"}, "name": "conv2d_9"}, {"inbound_nodes": [[["concatenate_6", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_7"}, "name": "concatenate_7"}, {"inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_9"}, "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_10"}, "name": "conv2d_10"}, {"inbound_nodes": [[["concatenate_7", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_8"}, "name": "concatenate_8"}, {"inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_10"}, "name": "batch_normalization_10"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_11"}, "name": "conv2d_11"}, {"inbound_nodes": [[["concatenate_8", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_9"}, "name": "concatenate_9"}, {"inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_11"}, "name": "batch_normalization_11"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_12"}, "name": "conv2d_12"}, {"inbound_nodes": [[["concatenate_9", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_10"}, "name": "concatenate_10"}, {"inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_12"}, "name": "batch_normalization_12"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 144, "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "name": "conv2d_13"}, "name": "conv2d_13"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "average_pooling2d_2"}, "name": "average_pooling2d_2"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_13"}, "name": "batch_normalization_13"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "name": "activation_13"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_14"}, "name": "conv2d_14"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}], ["conv2d_14", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_11"}, "name": "concatenate_11"}, {"inbound_nodes": [[["concatenate_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_14"}, "name": "batch_normalization_14"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "name": "activation_14"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_15"}, "name": "conv2d_15"}, {"inbound_nodes": [[["concatenate_11", 0, 0, {}], ["conv2d_15", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_12"}, "name": "concatenate_12"}, {"inbound_nodes": [[["concatenate_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_15"}, "name": "batch_normalization_15"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "name": "activation_15"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_16"}, "name": "conv2d_16"}, {"inbound_nodes": [[["concatenate_12", 0, 0, {}], ["conv2d_16", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_13"}, "name": "concatenate_13"}, {"inbound_nodes": [[["concatenate_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_16"}, "name": "batch_normalization_16"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "name": "activation_16"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_17"}, "name": "conv2d_17"}, {"inbound_nodes": [[["concatenate_13", 0, 0, {}], ["conv2d_17", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_14"}, "name": "concatenate_14"}, {"inbound_nodes": [[["concatenate_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_17"}, "name": "batch_normalization_17"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "name": "activation_17"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "padding": "same", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "normal", "mode": "fan_in"}}, "filters": 12, "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_18"}, "name": "conv2d_18"}, {"inbound_nodes": [[["concatenate_14", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_15"}, "name": "concatenate_15"}, {"inbound_nodes": [[["concatenate_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.1e-05, "scale": true, "name": "batch_normalization_18"}, "name": "batch_normalization_18"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "name": "activation_18"}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}, "name": "global_average_pooling2d_1"}], "name": "densenet"}, "class_name": "Model"}, {"inbound_nodes": [[["densenet", 1, 0, {}]]], "name": "dense_1", "config": {"trainable": true, "activity_regularizer": null, "units": 128, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "feat_a", "config": {"trainable": true, "activity_regularizer": null, "units": 32, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "feat_a"}, "class_name": "Dense"}, {"inbound_nodes": [[["feat_a", 0, 0, {}]]], "name": "pred_a", "config": {"trainable": true, "activity_regularizer": null, "units": 1, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "pred_a"}, "class_name": "Dense"}], "output_layers": [["pred_a", 0, 0]], "input_layers": [["input_1", 0, 0]]}}