{"class_name": "Model", "keras_version": "2.1.5", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_5", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_1", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_5", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_6", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_2", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_6", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_2", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "average_pooling2d_2", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_7", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_3", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_7", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_3", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "average_pooling2d_3", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_3", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_8", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_4", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_8", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "name": "batch_normalization_4", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "filters": 10, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_11", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "filters": 10, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_12", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "filters": 10, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_13", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "filters": 10, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_14", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "filters": 10, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_9", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_size": [1, 1], "filters": 10, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_10", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "trainable": true, "strides": [4, 4], "pool_size": [4, 4], "padding": "valid"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "average_pooling2d_4", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_4", "trainable": true, "strides": [4, 4], "pool_size": [4, 4], "padding": "valid"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_5", "trainable": true, "strides": [8, 8], "pool_size": [8, 8], "padding": "valid"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "average_pooling2d_5", "class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "name": "average_pooling2d_5", "trainable": true, "strides": [8, 8], "pool_size": [8, 8], "padding": "valid"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "flatten_3", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}, "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]]}, {"name": "flatten_5", "class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "flatten_6", "class_name": "Flatten", "config": {"name": "flatten_6", "trainable": true}, "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}, "inbound_nodes": [[["flatten_6", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_4", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_5", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_7", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_8", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"name": "multiply_4", "class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "multiply_6", "class_name": "Multiply", "config": {"name": "multiply_6", "trainable": true}, "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_3", "trainable": true, "units": 6, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_6", "trainable": true, "units": 6, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["multiply_4", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_9", "trainable": true, "units": 6, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["multiply_6", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"name": "multiply_3", "class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true}, "inbound_nodes": [[["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]]}, {"name": "multiply_5", "class_name": "Multiply", "config": {"name": "multiply_5", "trainable": true}, "inbound_nodes": [[["flatten_5", 0, 0, {}], ["flatten_6", 0, 0, {}]]]}, {"name": "pred_age_stage1", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "pred_age_stage1", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "pred_age_stage2", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "pred_age_stage2", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"name": "pred_age_stage3", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "pred_age_stage3", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"name": "delta_s1", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "delta_s1", "trainable": true, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "delta_s2", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "delta_s2", "trainable": true, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"name": "delta_s3", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "delta_s3", "trainable": true, "units": 1, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["multiply_5", 0, 0, {}]]]}, {"name": "local_delta_stage1", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "local_delta_stage1", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "local_delta_stage2", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "local_delta_stage2", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"name": "local_delta_stage3", "class_name": "Dense", "config": {"bias_regularizer": null, "name": "local_delta_stage3", "trainable": true, "units": 3, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"name": "pred_a", "class_name": "Lambda", "config": {"output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "name": "pred_a", "trainable": true, "arguments": {"lambda_d": 1.0, "s1": 3, "s2": 3, "s3": 3, "lambda_local": 1.0}, "function": ["4wYAAAAAAAAADwAAAAcAAABTAAAAc0wCAAB8AABkAQAZZAAAZAAAhQIAZAEAZgIAGWQBABR9BgB8\nAABkAQAZZAAAZAAAhQIAZAEAZgIAGWQBABR9BwB8AABkAQAZZAAAZAAAhQIAZAEAZgIAGWQBABR9\nCAB8AQB8AgAUfAMAFH0JAGQCAH0KAHhVAHQAAGQBAHwBAIMCAERdRAB9CwB8BgB8CwB8BAB8AABk\nAwAZZAAAZAAAhQIAfAsAZgIAGRQXfAAAZAEAGWQAAGQAAIUCAHwLAGYCABkUF30GAHF+AFd0AQBq\nAgB8BgBkCwCDAgB9BgB8BgB8AQBkBAB8BQB8AABkBQAZFBcUG30GAHhVAHQAAGQBAHwCAIMCAERd\nRAB9DAB8BwB8DAB8BAB8AABkBgAZZAAAZAAAhQIAfAwAZgIAGRQXfAAAZAQAGWQAAGQAAIUCAHwM\nAGYCABkUF30HAHECAVd0AQBqAgB8BwBkDACDAgB9BwB8BwB8AQBkBAB8BQB8AABkBQAZFBcUG3wC\nAGQEAHwFAHwAAGQHABkUFxQbfQcAeFUAdAAAZAEAfAMAgwIARF1EAH0NAHwIAHwNAHwEAHwAAGQI\nABlkAABkAACFAgB8DQBmAgAZFBd8AABkCQAZZAAAZAAAhQIAfA0AZgIAGRQXfQgAcZoBV3QBAGoC\nAHwIAGQNAIMCAH0IAHwIAHwBAGQEAHwFAHwAAGQFABkUFxQbfAIAZAQAfAUAfAAAZAcAGRQXFBt8\nAwBkBAB8BQB8AABkCgAZFBcUG30IAHwGAHwHABd8CAAXfAoAFH0OAHwOAFMpDk7pAAAAAOllAAAA\n6QYAAADpAQAAAOkDAAAA6QcAAADpBAAAAOkIAAAA6QIAAADpBQAAAOn/////cgsAAAByCwAAACkD\n2gVyYW5nZdoBS9oLZXhwYW5kX2RpbXMpD9oBeNoCczHaAnMy2gJzM9oMbGFtYmRhX2xvY2Fs2ghs\nYW1iZGFfZNoBYdoBYtoBY9oBQdoBVtoBadoBatoBa9oDYWdlqQByHgAAAPpgL2hvbWUvc2hhbWFu\nZ2FyeS9EZXNrdG9wL2NvZGVEZW1vL2FnZS1nZW5kZXIvU1NSLU5ldC1tYXN0ZXIvdHJhaW5pbmdf\nYW5kX3Rlc3RpbmcvU1NSTkVUX21vZGVsLnB52gltZXJnZV9hZ2WSAAAAcyYAAAAAAR4BHgEeAQ4B\nBgIWAUIBEgEaAhYBQgESAS4CFgFCARIBQgMSAQ==\n", null, null]}, "inbound_nodes": [[["pred_age_stage1", 0, 0, {}], ["pred_age_stage2", 0, 0, {}], ["pred_age_stage3", 0, 0, {}], ["delta_s1", 0, 0, {}], ["delta_s2", 0, 0, {}], ["delta_s3", 0, 0, {}], ["local_delta_stage1", 0, 0, {}], ["local_delta_stage2", 0, 0, {}], ["local_delta_stage3", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["pred_a", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}