{"keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "name": "input_2"}, "class_name": "InputLayer", "name": "input_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "kernel_size": [3, 3], "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv1_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv1_bn"}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv1_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv1_relu"}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_1", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_1"}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_1_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_1_bn"}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_1_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_1_relu"}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_1"}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_1_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_1_bn"}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_1_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_1_relu"}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_2", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_2"}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_2_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_2_bn"}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_2_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_2_relu"}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_2"}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_2_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_2_bn"}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_2_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_2_relu"}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_3", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_3"}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_3_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_3_bn"}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_3_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_3_relu"}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_3", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_3"}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_3_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_3_bn"}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_3_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_3_relu"}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_4", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_4"}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_4_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_4_bn"}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_4_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_4_relu"}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_4", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_4"}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_4_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_4_bn"}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_4_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_4_relu"}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_5", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_5"}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_5_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_5_bn"}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_5_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_5_relu"}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_5", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_5"}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_5_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_5_bn"}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_5_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_5_relu"}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_6", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_6"}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_6_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_6_bn"}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_6_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_6_relu"}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_6", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_6"}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_6_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_6_bn"}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_6_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_6_relu"}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_7", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_7"}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_7_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_7_bn"}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_7_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_7_relu"}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_7", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_7"}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_7_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_7_bn"}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_7_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_7_relu"}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_8", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_8"}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_8_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_8_bn"}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_8_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_8_relu"}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_8", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_8"}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_8_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_8_bn"}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_8_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_8_relu"}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_9", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_9"}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_9_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_9_bn"}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_9_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_9_relu"}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_9", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_9"}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_9_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_9_bn"}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_9_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_9_relu"}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_10", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_10"}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_10_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_10_bn"}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_10_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_10_relu"}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_10", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_10"}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_10_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_10_bn"}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_10_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_10_relu"}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_11", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_11"}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_11_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_11_bn"}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_11_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_11_relu"}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_11", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_11"}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_11_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_11_bn"}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_11_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_11_relu"}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_12", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [2, 2], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_12"}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_12_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_12_bn"}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_12_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_12_relu"}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_12", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_12"}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_12_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_12_bn"}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_12_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_12_relu"}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_13", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "depthwise_constraint": null, "depth_multiplier": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "depthwise_regularizer": null}, "class_name": "DepthwiseConv2D", "name": "conv_dw_13"}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_dw_13_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_dw_13_bn"}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_dw_13_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_dw_13_relu"}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "linear", "name": "conv_pw_13", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": false, "trainable": true, "data_format": "channels_last", "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv_pw_13"}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"beta_constraint": null, "name": "conv_pw_13_bn", "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "center": true, "scale": true, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "conv_pw_13_bn"}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"trainable": true, "name": "conv_pw_13_relu", "activation": "relu6"}, "class_name": "Activation", "name": "conv_pw_13_relu"}], "output_layers": [["conv_pw_13_relu", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "mobilenet_0.50_64"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "mobilenet_0.50_64"}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_1", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [1, 1], "filters": 20, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["mobilenet_0.50_64", 1, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "feat_a", "units": 32, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "feat_a"}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "pred_a", "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["feat_a", 0, 0, {}]]], "name": "pred_a"}], "output_layers": [["pred_a", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model", "backend": "tensorflow"}