{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "name": "input_1", "sparse": false}}, {"class_name": "Model", "name": "mobilenet_0.25_64", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "name": "input_2", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv1", "config": {"name": "conv1", "kernel_size": [3, 3], "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 8}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv1_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv1_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_1", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_1_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_1_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "config": {"name": "conv_pw_1", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 16}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_1_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_1_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_dw_2", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_2", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_2_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_2_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "config": {"name": "conv_pw_2", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_2_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_2_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_3", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_3_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_3_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "config": {"name": "conv_pw_3", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 32}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_3_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_3_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_dw_4", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_4", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_4_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_4_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "config": {"name": "conv_pw_4", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_4_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_4_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_5", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_5_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_5_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "config": {"name": "conv_pw_5", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 64}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_5_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_5_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_dw_6", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_6", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_6_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_6_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "config": {"name": "conv_pw_6", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 128}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_6_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_6_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_7", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_7_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_7_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "config": {"name": "conv_pw_7", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 128}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_7_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_7_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_8", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_8_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_8_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "config": {"name": "conv_pw_8", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 128}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_8_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_8_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_9", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_9_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_9_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "config": {"name": "conv_pw_9", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 128}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_9_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_9_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_10", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_10_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_10_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "config": {"name": "conv_pw_10", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 128}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_10_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_10_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_11", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_11_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_11_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "config": {"name": "conv_pw_11", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 128}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_11_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_11_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_dw_12", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_12", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_12_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_12_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "config": {"name": "conv_pw_12", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 256}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_12_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_12_relu"}}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "depthwise_regularizer": null, "use_bias": false, "depth_multiplier": 1, "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "trainable": true, "name": "conv_dw_13", "activity_regularizer": null, "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_dw_13_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_dw_13_relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13", "config": {"name": "conv_pw_13", "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_constraint": null, "filters": 256}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn", "config": {"scale": true, "gamma_regularizer": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "name": "conv_pw_13_bn", "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu", "config": {"activation": "relu6", "trainable": true, "name": "conv_pw_13_relu"}}], "input_layers": [["input_2", 0, 0]], "output_layers": [["conv_pw_13_relu", 0, 0]], "name": "mobilenet_0.25_64"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["mobilenet_0.25_64", 1, 0, {}]]], "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "trainable": true, "name": "conv2d_1", "activity_regularizer": null, "padding": "valid", "use_bias": true, "bias_constraint": null, "filters": 20}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "name": "feat_a", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"units": 32, "name": "feat_a", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "name": "pred_a", "inbound_nodes": [[["feat_a", 0, 0, {}]]], "config": {"units": 1, "name": "pred_a", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "trainable": true, "use_bias": true, "activity_regularizer": null}}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["pred_a", 0, 0]]}}