{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Model", "name": "mobilenet_0.25_64", "config": {"output_layers": [["conv_pw_13_relu", 0, 0]], "input_layers": [["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "name": "input_2", "sparse": false}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv1", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": false, "filters": 8, "strides": [2, 2], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1"}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv1_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv1_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv1_relu", "config": {"activation": "relu6", "name": "conv1_relu", "trainable": true}}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_1", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_1", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_1_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_1_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_1_relu", "config": {"activation": "relu6", "name": "conv_dw_1_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_1", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 16, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_1"}}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_1_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_1_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_1_relu", "config": {"activation": "relu6", "name": "conv_pw_1_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_2", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_2", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_2_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_2_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_2_relu", "config": {"activation": "relu6", "name": "conv_dw_2_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_2", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 32, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_2"}}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_2_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_2_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_2_relu", "config": {"activation": "relu6", "name": "conv_pw_2_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_3", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_3", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_3_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_3_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_3_relu", "config": {"activation": "relu6", "name": "conv_dw_3_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_3", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 32, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_3"}}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_3_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_3_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_3_relu", "config": {"activation": "relu6", "name": "conv_pw_3_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_4", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_4", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_4_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_4_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_4_relu", "config": {"activation": "relu6", "name": "conv_dw_4_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_4", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 64, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_4"}}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_4_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_4_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_4_relu", "config": {"activation": "relu6", "name": "conv_pw_4_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_5", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_5", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_5_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_5_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_5_relu", "config": {"activation": "relu6", "name": "conv_dw_5_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_5", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 64, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_5"}}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_5_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_5_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_5_relu", "config": {"activation": "relu6", "name": "conv_pw_5_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_6", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_6", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_6_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_6_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_6_relu", "config": {"activation": "relu6", "name": "conv_dw_6_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_6", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 128, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_6"}}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_6_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_6_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_6_relu", "config": {"activation": "relu6", "name": "conv_pw_6_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_7", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_7", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_7_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_7_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_7_relu", "config": {"activation": "relu6", "name": "conv_dw_7_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_7", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 128, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_7"}}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_7_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_7_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_7_relu", "config": {"activation": "relu6", "name": "conv_pw_7_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_8", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_8", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_8_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_8_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_8_relu", "config": {"activation": "relu6", "name": "conv_dw_8_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_8", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 128, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_8"}}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_8_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_8_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_8_relu", "config": {"activation": "relu6", "name": "conv_pw_8_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_9", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_9", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_9_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_9_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_9_relu", "config": {"activation": "relu6", "name": "conv_dw_9_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_9", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 128, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_9"}}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_9_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_9_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_9_relu", "config": {"activation": "relu6", "name": "conv_pw_9_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_10", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_10", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_10_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_10_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_10_relu", "config": {"activation": "relu6", "name": "conv_dw_10_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_10", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 128, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_10"}}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_10_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_10_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_10_relu", "config": {"activation": "relu6", "name": "conv_pw_10_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_11", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_11", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_11_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_11_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_11_relu", "config": {"activation": "relu6", "name": "conv_dw_11_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_11", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 128, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_11"}}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_11_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_11_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_11_relu", "config": {"activation": "relu6", "name": "conv_pw_11_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_12", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [2, 2], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_12", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_12_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_12_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_12_relu", "config": {"activation": "relu6", "name": "conv_dw_12_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_12", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 256, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_12"}}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_12_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_12_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_12_relu", "config": {"activation": "relu6", "name": "conv_pw_12_relu", "trainable": true}}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "name": "conv_dw_13", "config": {"data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "use_bias": false, "trainable": true, "depth_multiplier": 1, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "same", "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_constraint": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv_dw_13", "bias_regularizer": null}}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_dw_13_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_dw_13_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_dw_13_relu", "config": {"activation": "relu6", "name": "conv_dw_13_relu", "trainable": true}}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv_pw_13", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "use_bias": false, "filters": 256, "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_13"}}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "conv_pw_13_bn", "config": {"momentum": 0.99, "beta_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "name": "conv_pw_13_bn", "epsilon": 0.001}}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "Activation", "name": "conv_pw_13_relu", "config": {"activation": "relu6", "name": "conv_pw_13_relu", "trainable": true}}], "name": "mobilenet_0.25_64"}}, {"inbound_nodes": [[["mobilenet_0.25_64", 1, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "filters": 20, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1"}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "feat_a", "config": {"kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "name": "feat_a"}}, {"inbound_nodes": [[["feat_a", 0, 0, {}]]], "class_name": "Dense", "name": "pred_a", "config": {"kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "name": "pred_a"}}], "output_layers": [["pred_a", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}