{"keras_version": "2.0.6", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["pred_a", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "filters": 16, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "filters": 32, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_1"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "activation": "tanh", "name": "activation_5"}, "name": "activation_5"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"trainable": true, "name": "average_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "filters": 16, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "filters": 32, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_2"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "activation": "tanh", "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"trainable": true, "name": "average_pooling2d_2", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_7", "filters": 16, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "filters": 32, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_3"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "activation": "tanh", "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"trainable": true, "name": "average_pooling2d_3", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_8", "filters": 16, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "filters": 32, "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"trainable": true, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "scale": true}, "name": "batch_normalization_4"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "activation": "tanh", "name": "activation_8"}, "name": "activation_8"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_11", "filters": 10, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_12", "filters": 10, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_13", "filters": 10, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_14", "filters": 10, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_9", "filters": 10, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_10", "filters": 10, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "conv2d_10"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_4", "padding": "valid", "strides": [4, 4], "pool_size": [4, 4], "data_format": "channels_last"}, "name": "max_pooling2d_4"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"trainable": true, "name": "average_pooling2d_4", "padding": "valid", "strides": [4, 4], "pool_size": [4, 4], "data_format": "channels_last"}, "name": "average_pooling2d_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_5", "padding": "valid", "strides": [8, 8], "pool_size": [8, 8], "data_format": "channels_last"}, "name": "max_pooling2d_5"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"trainable": true, "name": "average_pooling2d_5", "padding": "valid", "strides": [8, 8], "pool_size": [8, 8], "data_format": "channels_last"}, "name": "average_pooling2d_5"}, {"class_name": "Flatten", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Flatten", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_3"}, "name": "flatten_3"}, {"class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_4", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_4"}, "name": "flatten_4"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_5"}, "name": "flatten_5"}, {"class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_5", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_6"}, "name": "flatten_6"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_4"}, "name": "dropout_4"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_5", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_5"}, "name": "dropout_5"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_6", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.2, "name": "dropout_6"}, "name": "dropout_6"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_1"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_2"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_4", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_4"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_5", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_5"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_7", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_7"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_8", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_8"}, {"class_name": "Multiply", "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_2"}, "name": "multiply_2"}, {"class_name": "Multiply", "inbound_nodes": [[["dense_4", 0, 0, {}], ["dense_5", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_4"}, "name": "multiply_4"}, {"class_name": "Multiply", "inbound_nodes": [[["dense_7", 0, 0, {}], ["dense_8", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_6"}, "name": "multiply_6"}, {"class_name": "Dense", "inbound_nodes": [[["multiply_2", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_3"}, {"class_name": "Dense", "inbound_nodes": [[["multiply_4", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_6", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_6"}, {"class_name": "Dense", "inbound_nodes": [[["multiply_6", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_9", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "dense_9"}, {"class_name": "Multiply", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_1"}, "name": "multiply_1"}, {"class_name": "Multiply", "inbound_nodes": [[["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_3"}, "name": "multiply_3"}, {"class_name": "Multiply", "inbound_nodes": [[["flatten_5", 0, 0, {}], ["flatten_6", 0, 0, {}]]], "config": {"trainable": true, "name": "multiply_5"}, "name": "multiply_5"}, {"class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "pred_age_stage1", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "pred_age_stage1"}, {"class_name": "Dense", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "pred_age_stage2", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "pred_age_stage2"}, {"class_name": "Dense", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "pred_age_stage3", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "pred_age_stage3"}, {"class_name": "Dense", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "delta_s1", "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "delta_s1"}, {"class_name": "Dense", "inbound_nodes": [[["multiply_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "delta_s2", "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "delta_s2"}, {"class_name": "Dense", "inbound_nodes": [[["multiply_5", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "delta_s3", "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "delta_s3"}, {"class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "local_delta_stage1", "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "local_delta_stage1"}, {"class_name": "Dense", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "local_delta_stage2", "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "local_delta_stage2"}, {"class_name": "Dense", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "config": {"trainable": true, "kernel_regularizer": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "local_delta_stage3", "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}, "name": "local_delta_stage3"}, {"class_name": "Lambda", "inbound_nodes": [[["pred_age_stage1", 0, 0, {}], ["pred_age_stage2", 0, 0, {}], ["pred_age_stage3", 0, 0, {}], ["delta_s1", 0, 0, {}], ["delta_s2", 0, 0, {}], ["delta_s3", 0, 0, {}], ["local_delta_stage1", 0, 0, {}], ["local_delta_stage2", 0, 0, {}], ["local_delta_stage3", 0, 0, {}]]], "config": {"trainable": true, "arguments": {"s2": 3, "lambda_d": 1.0, "lambda_local": 1.0, "s3": 3, "s1": 3}, "output_shape_type": "raw", "output_shape": [1], "name": "pred_a", "function": ["\u00e3\u0006\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u000e\u0000\u0000\u0000\u0007\u0000\u0000\u0000S\u0000\u0000\u0000s\u0016\u0002\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000f\u0002\u0000\u0019d\u0001\u0000\u0014}\u0006\u0000|\u0000\u0000d\u0001\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000f\u0002\u0000\u0019d\u0001\u0000\u0014}\u0007\u0000|\u0000\u0000d\u0001\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000f\u0002\u0000\u0019d\u0001\u0000\u0014}\b\u0000|\u0001\u0000|\u0002\u0000\u0014|\u0003\u0000\u0014}\t\u0000d\u0002\u0000}\n\u0000xU\u0000t\u0000\u0000d\u0001\u0000|\u0001\u0000\u0083\u0002\u0000D]D\u0000}\u000b\u0000|\u0006\u0000|\u000b\u0000|\u0004\u0000|\u0000\u0000d\u0003\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u000b\u0000f\u0002\u0000\u0019\u0014\u0017|\u0000\u0000d\u0001\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\u000b\u0000f\u0002\u0000\u0019\u0014\u0017}\u0006\u0000q~\u0000W|\u0006\u0000|\u0001\u0000d\u0004\u0000|\u0005\u0000|\u0000\u0000d\u0005\u0000\u0019\u0014\u0017\u0014\u001b}\u0006\u0000xU\u0000t\u0000\u0000d\u0001\u0000|\u0002\u0000\u0083\u0002\u0000D]D\u0000}\f\u0000|\u0007\u0000|\f\u0000|\u0004\u0000|\u0000\u0000d\u0006\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\f\u0000f\u0002\u0000\u0019\u0014\u0017|\u0000\u0000d\u0004\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\f\u0000f\u0002\u0000\u0019\u0014\u0017}\u0007\u0000q\u00f0\u0000W|\u0007\u0000|\u0001\u0000d\u0004\u0000|\u0005\u0000|\u0000\u0000d\u0005\u0000\u0019\u0014\u0017\u0014\u001b|\u0002\u0000d\u0004\u0000|\u0005\u0000|\u0000\u0000d\u0007\u0000\u0019\u0014\u0017\u0014\u001b}\u0007\u0000xU\u0000t\u0000\u0000d\u0001\u0000|\u0003\u0000\u0083\u0002\u0000D]D\u0000}\r\u0000|\b\u0000|\r\u0000|\u0004\u0000|\u0000\u0000d\b\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\r\u0000f\u0002\u0000\u0019\u0014\u0017|\u0000\u0000d\t\u0000\u0019d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000|\r\u0000f\u0002\u0000\u0019\u0014\u0017}\b\u0000qv\u0001W|\b\u0000|\u0001\u0000d\u0004\u0000|\u0005\u0000|\u0000\u0000d\u0005\u0000\u0019\u0014\u0017\u0014\u001b|\u0002\u0000d\u0004\u0000|\u0005\u0000|\u0000\u0000d\u0007\u0000\u0019\u0014\u0017\u0014\u001b|\u0003\u0000d\u0004\u0000|\u0005\u0000|\u0000\u0000d\n\u0000\u0019\u0014\u0017\u0014\u001b}\b\u0000|\u0006\u0000|\u0007\u0000\u0017|\b\u0000\u0017|\n\u0000\u0014}\u0006\u0000|\u0006\u0000S)\u000bN\u00e9\u0000\u0000\u0000\u0000\u00e9e\u0000\u0000\u0000\u00e9\u0006\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00e9\u0007\u0000\u0000\u0000\u00e9\u0004\u0000\u0000\u0000\u00e9\b\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00e9\u0005\u0000\u0000\u0000)\u0001\u00da\u0005range)\u000e\u00da\u0001x\u00da\u0002s1\u00da\u0002s2\u00da\u0002s3\u00da\flambda_local\u00da\blambda_d\u00da\u0001a\u00da\u0001b\u00da\u0001c\u00da\u0001A\u00da\u0001V\u00da\u0001i\u00da\u0001j\u00da\u0001k\u00a9\u0000r\u001a\u0000\u0000\u0000\u00faE/home/shamangary/Desktop/codeDemo/age-gender/training/SSRNET_model.py\u00da\tmerge_age\u00fd\u0003\u0000\u0000s \u0000\u0000\u0000\u0000\u0001\u001e\u0001\u001e\u0001\u001e\u0001\u000e\u0001\u0006\u0003\u0016\u0001B\u0001\u001a\u0002\u0016\u0001B\u0001.\u0002\u0016\u0001B\u0001B\u0003\u0012\u0001", null, null], "function_type": "lambda"}, "name": "pred_a"}], "input_layers": [["input_1", 0, 0]]}}